#Область ОписаниеПеременных

Перем Данные Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Коллекция() Экспорт
	
	Возврат Данные;
	
КонецФункции

Функция Вставить(Индекс, Значение) Экспорт
	
	Данные.Вставить(Индекс, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Установить(Индекс, Значение) Экспорт
	
	Данные.Установить(Индекс, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция НайтиЗначение(Значение) Экспорт
	
	Возврат Данные.Найти(Значение);
	
КонецФункции

Функция Получить(Индекс) Экспорт
	
	Возврат Данные.Получить(Индекс);
	
КонецФункции

Функция Добавить(Значение) Экспорт
	
	Данные.Добавить(Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Удалить(Значение) Экспорт
	
	Данные.Удалить(Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Количество() Экспорт
	
	Возврат Данные.Количество();
	
КонецФункции

Функция Очистить() Экспорт
	
	Данные.Очистить();
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Данные = Новый Массив();

#КонецОбласти