#Область ОписаниеПеременных

Перем Методы;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Добавляет в состав шаблонf URL новый метод
//
// Параметры:
//  ТипМетода		- Строка	 - Тип метода (GET, POST, PUT, DELETE)
//  КраткоеОписание	- Строка	 - Текстово описание метода
// 
// Возвращаемое значение:
//  oapi_Метод - Ссылка на метод
//
Функция ДобавитьМетод(ТипМетода, КраткоеОписание = "") Экспорт
	
	Если Не ЗначениеЗаполнено(ТипМетода) Тогда
		ТекстОшибки = НСтр("ru='Не указан тип метода.'");
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	Метод = Методы[ТипМетода];
	
	Если Метод = Неопределено Тогда
		Метод = Обработки.oapi_Метод.Создать();
		Метод.Тип = ТипМетода;
		Метод.Сервис = Сервис;
		Метод.ШаблонURL = ЭтотОбъект;
		Методы[ТипМетода] = Метод;
	КонецЕсли;
	
	Метод.КраткоеОписание = КраткоеОписание;
	
	Возврат Метод;
	
КонецФункции

Функция Методы() Экспорт
	
	Возврат Методы;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Методы = Новый Соответствие();

#КонецОбласти