#Область ОписаниеПеременных

Перем Значение Экспорт;
Перем ЗначенияПеречислений;

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область УправлениеСтруктурой

Функция ДобавитьПеречисление(Строка) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		ТекстОшибки = НСтр("ru='Перечисление можно добавлять только к типу ""Строка"".'");
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	МассивПеречислений = СтрРазделить(Строка, ",", Ложь);
	
	Для Каждого Перечисление Из МассивПеречислений Цикл
		ЗначенияПеречислений.Добавить(Перечисление);
	КонецЦикла;
	
	Возврат ЭтотОбъект;
	
КонецФункции

#КонецОбласти

Функция Перечисления() Экспорт
	
	Возврат ЗначенияПеречислений;
	
КонецФункции

#КонецОбласти

#Область Инициализация

ЗначенияПеречислений = Новый Массив();

#КонецОбласти