#Область ОписаниеПеременных

Перем Данные Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Коллекция() Экспорт
	
	Возврат Данные;
	
КонецФункции

Функция Вставить(Ключ, Значение) Экспорт

	Если Не Обработки.oapi_Сервис.ЭтоРасширенныйТипДанных(Значение) Тогда
		ТекстОшибки = НСтр("ru='В качестве значения должен выступать расширенный тип, например ТипСтруктура, ТипМассив, ТипЧисло.'");
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	Данные.Вставить(Ключ, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Получить(Ключ) Экспорт
	
	Возврат Данные.Получить(Ключ);
	
КонецФункции

Функция Удалить(Ключ) Экспорт
	
	Данные.Удалить(Ключ);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Количество() Экспорт
	
	Возврат Данные.Количество();
	
КонецФункции

Функция Очистить() Экспорт
	
	Данные.Очистить();
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Свойство(Ключ, Значение = Неопределено) Экспорт
	
	Значение = Данные[Ключ];
	Возврат Значение <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область Инициализация

Данные = Новый Соответствие();

#КонецОбласти