#Область ОписаниеПеременных

Перем Данные Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция Коллекция() Экспорт
	
	Возврат Данные;
	
КонецФункции

Функция Вставить(Ключ, Значение) Экспорт
	
	Данные.Вставить(Ключ, Значение);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Удалить(Ключ) Экспорт
	
	Данные.Удалить(Ключ);
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Количество() Экспорт
	
	Возврат Данные.Количество();
	
КонецФункции

Функция Очистить() Экспорт
	
	Данные.Очистить();
	Возврат ЭтотОбъект;
	
КонецФункции

Функция Свойство(Ключ, Значение = Неопределено) Экспорт
	
	Возврат Данные.Свойство(Ключ, Значение);
	
КонецФункции

#КонецОбласти

#Область Инициализация

Данные = Новый Структура();

#КонецОбласти