#Область ОписаниеПеременных

Перем Значение Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ФормированиеОписания

Функция ПолучитьОписание() Экспорт
	
	ОписаниеПараметра = Новый Структура();
	ОписаниеПараметра.Вставить("name", ИмяПараметра);
	
	Если ЯвляетсяЧастьюАдреса Тогда
		ОписаниеПараметра.Вставить("in", "path");
	Иначе
		ОписаниеПараметра.Вставить("in", "query");
	КонецЕсли;
	
	ОписаниеДанных = oapi_Описание.ПолучитьОписаниеДанных(Значение, Сервис);
	ОписаниеПараметра.Вставить("description", ОписаниеДанных.description);
	ОписаниеПараметра.Вставить("required", ОписаниеДанных.required);
	
	ОписаниеДанных.Удалить("description");
	ОписаниеДанных.Удалить("required");
	
	ОписаниеПараметра.Вставить("schema", ОписаниеДанных);
	
	Возврат ОписаниеПараметра;
	
КонецФункции

#КонецОбласти

Процедура УстановитьЗначение(ЗначениеПараметра) Экспорт
	
	Если Значение = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Значение параметра неопределено'");
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	Значение.Значение = ЗначениеПараметра;
	
КонецПроцедуры

#КонецОбласти